#+TITLE: Emacs Config
#+AUTHOR: Brandon T. Willard

#+STARTUP: hideblocks indent hidestars

** DONE [#A] Fix src_elisp{org-babel-result-end}                   :orgmode:
CLOSED: [2019-02-05 Tue 11:55]
~org-mode~ source blocks inside drawers will not replace existing results
(themselves in drawers).

The problem: src_elisp{(org-babel-result-end)} isn't working inside drawers.

Specifically, it looks like src_elisp{(org-element-at-point)} returns
a src_elisp{paragraph} element within a drawer.  Within that is the actual
nested drawer, but, since src_elisp{(org-babel-result-end)} fails to return
a recognized element type (i.e. not an element in
src_elisp{'(drawer example-block export-block fixed-width item plain-list src-block table)})
it fails.

#+BEGIN_SRC elisp :results drawer replace
(defun btw--org-babel-result-end ()
  "Return the point at the end of the current set of results."
  (cond
   ((looking-at-p "^[ \t]*$")
    (point)) ;no result
   ((looking-at-p (format "^[ \t]*%s[ \t]*$" org-bracket-link-regexp))
    (line-beginning-position 2))
   (t (let* ((element (org-element-at-point))
             (elements (cons element
                             (if (eq (org-element-type element) 'paragraph)
                                 (list (org-element-property :parent element))))))
        (if-let ((element (seq-find (lambda (x)
                                      (memq (org-element-type x)
                                            ;; Possible results types.
                                            '(drawer example-block export-block fixed-width
                                                     item plain-list src-block table)))
                                    elements)))
            (save-excursion
              (goto-char (min (point-max) ;for narrowed buffers
                              (org-element-property :end element)))
              (skip-chars-backward " \r\t\n")
              (line-beginning-position 2))
          (point))))))

(advice-add #'org-babel-result-end :override #'btw--org-babel-result-end)
#+END_SRC

#+RESULTS:
:RESULTS:
^[ 	]*:\(\(?:\w\|[-_]\)+\):[ 	]*$
:END:

# Start a drawer
:BLAH:

#+BEGIN_SRC elisp :results drawer replace
(print "hi")
#+END_SRC

# New, nested drawer
:BLOG:
#+BEGIN_SRC elisp :results drawer replace
(print "hi")
#+END_SRC

:END:

:END:
